Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40000420"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM0" edc:cname="FLEX_SPI_CSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40000430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM0">
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity"/>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:nzwidth="0x1" edc:desc="Clock Phase"/>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:nzwidth="0x1" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:nzwidth="0x1" edc:desc="Chip Select Active After Transfer"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:nzwidth="0x4" edc:desc="Bits Per Transfer">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:nzwidth="0x8" edc:desc="Serial Clock Bit Rate"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:nzwidth="0x8" edc:desc="Delay Before SPCK"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:nzwidth="0x8" edc:desc="Delay Between Consecutive Transfers"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM0" edc:cname="FLEX_SPI_CSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40000434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM0">
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity"/>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:nzwidth="0x1" edc:desc="Clock Phase"/>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:nzwidth="0x1" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:nzwidth="0x1" edc:desc="Chip Select Active After Transfer"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:nzwidth="0x4" edc:desc="Bits Per Transfer">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:nzwidth="0x8" edc:desc="Serial Clock Bit Rate"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:nzwidth="0x8" edc:desc="Delay Before SPCK"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:nzwidth="0x8" edc:desc="Delay Between Consecutive Transfers"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40000438"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM0" edc:cname="FLEX_SPI_FMR" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn----------nn--nn" edc:impl="0x3F3F0033" edc:_addr="0x40000440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM0">
            <edc:SFRFieldDef edc:cname="TXRDYM" edc:nzwidth="0x2" edc:desc="Transmit Data Register Empty Mode">
              <edc:SFRFieldSemantic edc:cname="ONE_DATA" edc:desc="TDRE will be at level '1' when at least one data can be written in the transmit FIFO. When DMA is enabled to transfer data, the chunk of 1 data (byte or halfword) must be configured in the DMA depending on FLEX_SPI_CSR0.BITS. If the transfer is performed by software, the access type (byte, halfword) must be defined depending on FLEX_SPI_CSR0.BITS." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TWO_DATA" edc:desc="TDRE will be at level '1' when at least two data can be written in the transmit FIFO. FIFO. To minimize system bus load, when DMA is enabled to transfer data, the chunk of 1 word (1 word carries 2 data) must be configured in the DMA. If the transfer is performed by software, the access type must be defined as word (2 data per access, 1 access)." edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDYM" edc:nzwidth="0x2" edc:desc="Receive Data Register Full Mode">
              <edc:SFRFieldSemantic edc:cname="ONE_DATA" edc:desc="RDRF will be at level '1' when at least one unread data is in the receive FIFO. When DMA is enabled to transfer data and FLEX_SPI_CSR0.BITS=0 (8 bits transfered on SPI line), the chunk of 1 byte must be configured in the DMA. When FLEX_SPI_CSR0.BITS&gt;0 (9 to 16 bits transfered on SPI line), the chunk of 1 halfword must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte or halfword depending on FLEX_SPI_CSR0.BITS." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TWO_DATA" edc:desc="RDRF will be at level '1' when at least two unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data and FLEX_SPI_CSR0.BITS=0 (8 bits transfered on SPI line), the chunk of 1 halfword (1 halfword carries 2 bytes) must be configured in the DMA. When FLEX_SPI_CSR0.BITS&gt;0 (9 to 16 bits transfered on SPI line), the chunk of 1 word (1 word carries 2 halfwords) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as halfword (2 bytes per access, 1 access when FLEX_SPI_CSR0.BITS=0), or word (2 halfwords per access, 2 accesses when FLEX_SPI_CSR0.BITS&gt;0)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_DATA" edc:desc="RDRF will be at level '1' when at least four unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data and FLEX_SPI_CSR0.BITS=0 (8 bits transfered on SPI line), the chunk of 1 word (1 halfword carries 4 bytes) must be configured in the DMA. When FLEX_SPI_CSR0.BITS&gt;0 (9 to 16 bits transfered on SPI line), the chunk of 2 words (1 word carries 4 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as word (4 bytes per access, 1 access when FLEX_SPI_CSR0.BITS=0 or 2 halfwords per access, 2 accesses when FLEX_SPI_CSR0.BITS&gt;0)." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXFTHRES" edc:nzwidth="0x6" edc:desc="Transmit FIFO Threshold"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXFTHRES" edc:nzwidth="0x6" edc:desc="Receive FIFO Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM0" edc:cname="FLEX_SPI_FLR" edc:nzwidth="0x20" edc:access="----------rrrrrr----------rrrrrr" edc:impl="0x3F003F" edc:_addr="0x40000444">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM0">
            <edc:SFRFieldDef edc:cname="TXFL" edc:nzwidth="0x6" edc:desc="Transmit FIFO Level"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="RXFL" edc:nzwidth="0x6" edc:desc="Receive FIFO Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM0" edc:cname="FLEX_SPI_CMPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40000448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM0">
            <edc:SFRFieldDef edc:cname="VAL1" edc:nzwidth="0x10" edc:desc="First Comparison Value for Received Character"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:nzwidth="0x10" edc:desc="Second Comparison Value for Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
