Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_IDR" edc:nzwidth="0x20" edc:access="wwwwwwww-w--w---wwwwwwwwwwwwwwww" edc:impl="0xFF48FFFF" edc:_addr="0x4000820C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Framing Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Parity Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:nzwidth="0x1" edc:desc="Max Number of Repetitions Reached Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Buffer Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear to Send Input Change Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MANE" edc:nzwidth="0x1" edc:desc="Manchester Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINBE" edc:nzwidth="0x1" edc:desc="LIN Bus Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINISFE" edc:nzwidth="0x1" edc:desc="LIN Inconsistent Synch Field Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINIPE" edc:nzwidth="0x1" edc:desc="LIN Identifier Parity Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINCE" edc:nzwidth="0x1" edc:desc="LIN Checksum Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Client Not Responding Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_IMR" edc:nzwidth="0x20" edc:access="rrrrrrrr-r--r---rrrrrrrrrrrrrrrr" edc:impl="0xFF48FFFF" edc:_addr="0x40008210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Framing Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Parity Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:nzwidth="0x1" edc:desc="Max Number of Repetitions Reached Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Buffer Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Buffer Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear to Send Input Change Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MANE" edc:nzwidth="0x1" edc:desc="Manchester Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINBE" edc:nzwidth="0x1" edc:desc="LIN Bus Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINISFE" edc:nzwidth="0x1" edc:desc="LIN Inconsistent Synch Field Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINIPE" edc:nzwidth="0x1" edc:desc="LIN Identifier Parity Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINCE" edc:nzwidth="0x1" edc:desc="LIN Checksum Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Client Not Responding Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_CSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrr--r---rrrrrrrrrrrrrrrr" edc:impl="0xFFC8FFFF" edc:_addr="0x40008214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready (cleared by reading FLEX_US_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmitter Ready (cleared by writing FLEX_US_THR)"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Break Received/End of Break"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX Buffer (cleared by writing FLEX_US_RCR or FLEX_US_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX Buffer (cleared by writing FLEX_US_TCR or FLEX_US_TNCR)"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Framing Error"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Parity Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Receiver Timeout"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmitter Empty (cleared by writing FLEX_US_THR)"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:nzwidth="0x1" edc:desc="Max Number of Repetitions Reached"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing FLEX_US_TCR or FLEX_US_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing FLEX_US_RCR or FLEX_US_RNCR)"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear to Send Input Change Flag"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Status"/>
            <edc:SFRFieldDef edc:cname="LINBLS" edc:nzwidth="0x1" edc:desc="LIN Bus Line Status"/>
            <edc:SFRFieldDef edc:cname="MANE" edc:nzwidth="0x1" edc:desc="Manchester Error"/>
            <edc:SFRFieldDef edc:cname="LINBE" edc:nzwidth="0x1" edc:desc="LIN Bit Error"/>
            <edc:SFRFieldDef edc:cname="LINISFE" edc:nzwidth="0x1" edc:desc="LIN Inconsistent Synch Field Error"/>
            <edc:SFRFieldDef edc:cname="LINIPE" edc:nzwidth="0x1" edc:desc="LIN Identifier Parity Error"/>
            <edc:SFRFieldDef edc:cname="LINCE" edc:nzwidth="0x1" edc:desc="LIN Checksum Error"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Client Not Responding Error"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_RHR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40008218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="RXCHR0" edc:nzwidth="0x8" edc:desc="Received Characters"/>
            <edc:SFRFieldDef edc:cname="RXCHR1" edc:nzwidth="0x8" edc:desc="Received Characters"/>
            <edc:AdjustPoint edc:offset="-1"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:nzwidth="0x1" edc:desc="Received Sync"/>
            <edc:SFRFieldDef edc:cname="RXCHR2" edc:nzwidth="0x8" edc:desc="Received Characters"/>
            <edc:SFRFieldDef edc:cname="RXCHR3" edc:nzwidth="0x8" edc:desc="Received Characters"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_THR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4000821C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="TXCHR0" edc:nzwidth="0x8" edc:desc="Character to be Transmitted"/>
            <edc:SFRFieldDef edc:cname="TXCHR1" edc:nzwidth="0x8" edc:desc="Character to be Transmitted"/>
            <edc:AdjustPoint edc:offset="-1"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:nzwidth="0x1" edc:desc="Sync Field to be Transmitted"/>
            <edc:SFRFieldDef edc:cname="TXCHR2" edc:nzwidth="0x8" edc:desc="Character to be Transmitted"/>
            <edc:SFRFieldDef edc:cname="TXCHR3" edc:nzwidth="0x8" edc:desc="Character to be Transmitted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_BRGR" edc:nzwidth="0x20" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:impl="0x7FFFF" edc:_addr="0x40008220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="CD" edc:nzwidth="0x10" edc:desc="Clock Divider"/>
            <edc:SFRFieldDef edc:cname="FP" edc:nzwidth="0x3" edc:desc="Fractional Part"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_RTOR" edc:nzwidth="0x20" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:impl="0x1FFFF" edc:_addr="0x40008224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="TO" edc:nzwidth="0x11" edc:desc="Timeout Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_TTGR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40008228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="TG" edc:nzwidth="0x8" edc:desc="Timeguard Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x4000822C"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_FIDI" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40008240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="FI_DI_RATIO" edc:nzwidth="0x10" edc:desc="FI Over DI Ratio Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
