Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_FMR" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn----------nn--nn" edc:impl="0x3F3F0033" edc:_addr="0x4000C650">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="TXRDYM" edc:nzwidth="0x2" edc:desc="Transmitter Ready Mode">
              <edc:SFRFieldSemantic edc:cname="ONE_DATA" edc:desc="TXRDY will be at level '1' when at least one data can be written in the transmit FIFO. When DMA is enabled to transfer data, the chunk of 1 byte must be configured in the DMA. If the transfer is performed by software, the access type must be defined as byte." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TWO_DATA" edc:desc="TXRDY will be at level '1' when at least two data can be written in the transmit FIFO. To minimize system bus load, when DMA is enabled to transfer data, the chunk of 1 halfword (1 halfword carries 2 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 2 accesses) or halfword (2 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_DATA" edc:desc="TXRDY will be at level '1' when at least four data can be written in the transmit FIFO. To minimize system bus load, when DMA is enabled to transfer data, the chunk of 1 word (1 word carries 4 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 4 accesses), halfword (2 bytes per access, 2 accesses) or word (4 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDYM" edc:nzwidth="0x2" edc:desc="Receiver Ready Mode">
              <edc:SFRFieldSemantic edc:cname="ONE_DATA" edc:desc="RXRDY will be at level '1' when at least one unread data is in the receive FIFO. When DMA is enabled to transfer data the chunk of 1 byte must be configured in the DMA. If the transfer is performed by software, the access type (byte, halfword) must be defined accordingly." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TWO_DATA" edc:desc="RXRDY will be at level '1' when at least two unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data, the chunk of 1 halfword (1 halfword carries 2 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 2 accesses) or halfword (2 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_DATA" edc:desc="RXRDY will be at level '1' when at least four unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data, the chunk of 1 word (1 word carries 4 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 4 accesses), halfword (2 bytes per access, 2 accesses) or word (4 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXFTHRES" edc:nzwidth="0x6" edc:desc="Transmit FIFO Threshold"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXFTHRES" edc:nzwidth="0x6" edc:desc="Receive FIFO Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_FLR" edc:nzwidth="0x20" edc:access="----------rrrrrr----------rrrrrr" edc:impl="0x3F003F" edc:_addr="0x4000C654">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="TXFL" edc:nzwidth="0x6" edc:desc="Transmit FIFO Level"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="RXFL" edc:nzwidth="0x6" edc:desc="Receive FIFO Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4000C658"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_FSR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x4000C660">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Empty Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Full Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Threshold Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Flag"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Flag"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="Receive FIFO Threshold Flag"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Pointer Error Flag"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Pointer Error Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_FIER" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4000C664">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_FIDR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4000C668">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_FIMR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x4000C66C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x74" edc:_addr="0x4000C670"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x4000C6E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x545749"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_WPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFFFF01" edc:_addr="0x4000C6E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x18" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3914" edc:_addr="0x4000C6EC"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_MR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x40010000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="OPMODE" edc:nzwidth="0x2" edc:desc="FLEXCOM Operating Mode">
              <edc:SFRFieldSemantic edc:cname="NO_COM" edc:desc="No communication" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="USART" edc:desc="All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,) SPI/TWI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="SPI operating mode is selected. USART/TWI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TWI" edc:desc="All TWI related protocols are selected (TWI, SMBus). USART/SPI related registers are not accessible and have no impact on IOs." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40010004"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_RHR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40010010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="RXDATA" edc:nzwidth="0x10" edc:desc="Receive Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40010014"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_THR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40010020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:nzwidth="0x10" edc:desc="Transmit Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xDC" edc:_addr="0x40010024"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_RPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_RCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40010104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:nzwidth="0x10" edc:desc="Receive Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_TPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:nzwidth="0x20" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_TCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4001010C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
