Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_FRR" edc:nzwidth="0x20" edc:access="---------------------nnn-----nnn" edc:impl="0x707" edc:_addr="0x40030008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x3" edc:desc="Clock Prescaler">
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV8" edc:desc="Slow clock is divided by 8" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV16" edc:desc="Slow clock is divided by 16" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV32" edc:desc="Slow clock is divided by 32" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV64" edc:desc="Slow clock is divided by 64" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV128" edc:desc="Slow clock is divided by 128" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV256" edc:desc="Slow clock is divided by 256" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV512" edc:desc="Slow clock is divided by 512" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_DIV1024" edc:desc="Slow clock is divided by 1024" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x3" edc:desc="Clock Division">
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV1" edc:desc="Clock output from prescaler is divided by 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV2" edc:desc="Clock output from prescaler is divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV3" edc:desc="Clock output from prescaler is divided by 3" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV4" edc:desc="Clock output from prescaler is divided by 4" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV5" edc:desc="Clock output from prescaler is divided by 5" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV6" edc:desc="Clock output from prescaler is divided by 6" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV7" edc:desc="Clock output from prescaler is divided by 7" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PRESC_CLK_DIV8" edc:desc="Clock output from prescaler is divided by 8" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_DR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn-----nnn" edc:impl="0xFF07" edc:_addr="0x4003000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="DISPMODE" edc:nzwidth="0x3" edc:desc="Display Mode Register">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal Mode-Latched data are displayed." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FORCE_OFF" edc:desc="Force Off Mode-All pixels are invisible. (The SLCDC memory is unchanged.)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FORCE_ON" edc:desc="Force On Mode-All pixels are visible. (The SLCDC memory is unchanged.)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BLINKING" edc:desc="Blinking Mode-All pixels are alternately turned off to the predefined state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="INVERTED" edc:desc="Inverted Mode-All pixels are set in the inverted state as defined in SLCDC memory. (The SLCDC memory is unchanged.)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="INVERTED_BLINK" edc:desc="Inverted Blinking Mode-All pixels are alternately turned off to the predefined opposite state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="USER_BUFFER_LOAD" edc:desc="User Buffer Only Load Mode-Blocks the automatic transfer from User Buffer to Display Buffer." edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="BUFFERS_SWAP" edc:desc="Buffer Swap Mode-All pixels are alternatively assigned to the state defined in the User Buffer, then to the state defined in the Display Buffer at LCDBLKFREQ frequency." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LCDBLKFREQ" edc:nzwidth="0x8" edc:desc="LCD Blinking Frequency Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_SR" edc:nzwidth="0x20" edc:access="------------------------rr-----r" edc:impl="0xC1" edc:_addr="0x40030010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="ENA" edc:nzwidth="0x1" edc:desc="Enable Status (Automatically Set/Reset)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DFFRZS" edc:nzwidth="0x1" edc:desc="Display Panel Features Configuration Freeze Status"/>
            <edc:SFRFieldDef edc:cname="MAPFRZS" edc:nzwidth="0x1" edc:desc="Remapping Configuration Freeze Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40030014"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_IER" edc:nzwidth="0x20" edc:access="-----------------------------w-w" edc:impl="0x5" edc:_addr="0x40030020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="ENDFRAME" edc:nzwidth="0x1" edc:desc="End of Frame Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:nzwidth="0x1" edc:desc="Disable Completion Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_IDR" edc:nzwidth="0x20" edc:access="-----------------------------w-w" edc:impl="0x5" edc:_addr="0x40030024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="ENDFRAME" edc:nzwidth="0x1" edc:desc="End of Frame Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:nzwidth="0x1" edc:desc="Disable Completion Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_IMR" edc:nzwidth="0x20" edc:access="-----------------------------r-r" edc:impl="0x5" edc:_addr="0x40030028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="ENDFRAME" edc:nzwidth="0x1" edc:desc="End of Frame Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:nzwidth="0x1" edc:desc="Disable Completion Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_ISR" edc:nzwidth="0x20" edc:access="-----------------------------r-r" edc:impl="0x5" edc:_addr="0x4003002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="ENDFRAME" edc:nzwidth="0x1" edc:desc="End of Frame Interrupt Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:nzwidth="0x1" edc:desc="Disable Completion Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
