Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003020C"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40030214"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003021C"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40030224"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003022C"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030230">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40030234"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_LMEMR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030238">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LPIXEL" edc:nzwidth="0x20" edc:desc="LSB Pixels Pattern Associated to COMx Terminal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3DC4" edc:_addr="0x4003023C"/>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_THR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40034000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="THDATA" edc:nzwidth="0x20" edc:desc="Transfer Holding Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_MR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x40034004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="TSIZE" edc:nzwidth="0x2" edc:desc="Transfer Size">
              <edc:SFRFieldSemantic edc:cname="T_8BIT" edc:desc="The buffer size is defined in bytes." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="T_16BIT" edc:desc="The buffer size is defined in half-words (16-bit)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="T_32BIT" edc:desc="The buffer size is defined in words (32-bit). Default value." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_IER" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x40034008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="RXEND" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Buffer Full Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_IDR" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x4003400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="RXEND" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Buffer Full Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_IMR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x40034010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="RXEND" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Buffer Full Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_ISR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x40034014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="RXEND" edc:nzwidth="0x1" edc:desc="End of Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Buffer Full"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------nn" edc:impl="0xFFFFFF03" edc:_addr="0x40034018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Configuration Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interruption Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN, WPITEN bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x4D454D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xE4" edc:_addr="0x4003401C"/>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_RPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40034100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM0" edc:cname="MEM2MEM0_RCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40034104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM0">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:nzwidth="0x10" edc:desc="Receive Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
