Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003C08C"/>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_CV" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4003C090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x20" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_RA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="RA" edc:nzwidth="0x20" edc:desc="Register A"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_RB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="RB" edc:nzwidth="0x20" edc:desc="Register B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_RC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C09C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="RC" edc:nzwidth="0x20" edc:desc="Register C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_SR" edc:nzwidth="0x20" edc:access="-------------rrr-----rrrrrrrrrrr" edc:impl="0x707FF" edc:_addr="0x4003C0A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer (cleared by writing TC_RCR or TC_RNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full (cleared by writing TC_RCR or TC_RNCR)"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CLKSTA" edc:nzwidth="0x1" edc:desc="Clock Enabling Status"/>
            <edc:SFRFieldDef edc:cname="MTIOA" edc:nzwidth="0x1" edc:desc="TIOAx Mirror"/>
            <edc:SFRFieldDef edc:cname="MTIOB" edc:nzwidth="0x1" edc:desc="TIOBx Mirror"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_IER" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x4003C0A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_IDR" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x4003C0A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_IMR" edc:nzwidth="0x20" edc:access="---------------------rrrrrrrrrrr" edc:impl="0x7FF" edc:_addr="0x4003C0AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
