Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="CHIPID" edc:cname="CHIPID_EXID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40050204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CHIPID">
            <edc:SFRFieldDef edc:cname="EXID" edc:nzwidth="0x20" edc:desc="Chip ID Extension"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x208" edc:_addr="0x40050208"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM0_SW_CFG" edc:nzwidth="0x20" edc:access="---------------n-nnn-nnn-nnn-nnn" edc:impl="0x17777" edc:_addr="0x40050410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="M128LS" edc:nzwidth="0x1" edc:desc="128 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M128DS" edc:nzwidth="0x1" edc:desc="128 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M128SD" edc:nzwidth="0x1" edc:desc="128 KB Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M256LS" edc:nzwidth="0x1" edc:desc="256 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M256DS" edc:nzwidth="0x1" edc:desc="256 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M256SD" edc:nzwidth="0x1" edc:desc="256 KB Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M384LS" edc:nzwidth="0x1" edc:desc="384 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M384DS" edc:nzwidth="0x1" edc:desc="384 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M384SD" edc:nzwidth="0x1" edc:desc="384 KB Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M512LS" edc:nzwidth="0x1" edc:desc="512 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M512DS" edc:nzwidth="0x1" edc:desc="512 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M512SD" edc:nzwidth="0x1" edc:desc="512 KB Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKG_DIS" edc:nzwidth="0x1" edc:desc="Clock Gating Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM0_HW_CFG" edc:nzwidth="0x20" edc:access="-----------------rrr-rrr-rrr-rrr" edc:impl="0x7777" edc:_addr="0x40050414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="M128LS" edc:nzwidth="0x1" edc:desc="128 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M128DS" edc:nzwidth="0x1" edc:desc="128 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M128SD" edc:nzwidth="0x1" edc:desc="128 KB Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M256LS" edc:nzwidth="0x1" edc:desc="256 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M256DS" edc:nzwidth="0x1" edc:desc="256 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M256SD" edc:nzwidth="0x1" edc:desc="256 KB Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M384LS" edc:nzwidth="0x1" edc:desc="384 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M384DS" edc:nzwidth="0x1" edc:desc="384 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M384SD" edc:nzwidth="0x1" edc:desc="384 KB Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M512LS" edc:nzwidth="0x1" edc:desc="512 KB Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M512DS" edc:nzwidth="0x1" edc:desc="512 KB Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="M512SD" edc:nzwidth="0x1" edc:desc="512 KB Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM0_CH0" edc:nzwidth="0x20" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:impl="0x1F1F1F1F" edc:_addr="0x40050418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM0" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME0" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM1" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME1" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM2" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME2" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM3" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME3" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM0_CH1" edc:nzwidth="0x20" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:impl="0x1F1F1F1F" edc:_addr="0x4005041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM0" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME0" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM1" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME1" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM2" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME2" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM3" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME3" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM0_CH2" edc:nzwidth="0x20" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:impl="0x1F1F1F1F" edc:_addr="0x40050420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM0" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME0" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM1" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME1" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM2" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME2" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM3" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME3" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
