Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM0_CH3" edc:nzwidth="0x20" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:impl="0x1F1F1F1F" edc:_addr="0x40050424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM0" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME0" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM1" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME1" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM2" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME2" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RM3" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME3" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM0" edc:nzwidth="0x20" edc:access="-----nnn----nnnnnnnnnnnnnnnnnnnn" edc:impl="0x70FFFFF" edc:_addr="0x40050428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM0" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RM1" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RM2" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RM3" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME0" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="RME1" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="RME2" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="RME3" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x1" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x1" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x1" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SRAM1" edc:nzwidth="0x20" edc:access="-----nnn----nnnnnnnnnnnnnnnnnnnn" edc:impl="0x70FFFFF" edc:_addr="0x4005042C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM0" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RM1" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RM2" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RM3" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME0" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="RME1" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="RME2" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="RME3" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x1" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x1" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x1" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_CPKCC" edc:nzwidth="0x20" edc:access="-----nnn---nnnnn------nn---nnnnn" edc:impl="0x71F031F" edc:_addr="0x40050430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_RM" edc:nzwidth="0x4" edc:desc="ROM Read Margin"/>
            <edc:SFRFieldDef edc:cname="ROM_RME" edc:nzwidth="0x1" edc:desc="ROM Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ROM_LS" edc:nzwidth="0x1" edc:desc="ROM Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="ROM_SD" edc:nzwidth="0x1" edc:desc="Shutdown Mode"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RAM_RM" edc:nzwidth="0x4" edc:desc="RAM Read Margin"/>
            <edc:SFRFieldDef edc:cname="RAM_RME" edc:nzwidth="0x1" edc:desc="RAM Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RAM_LS" edc:nzwidth="0x1" edc:desc="RAM Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="RAM_DS" edc:nzwidth="0x1" edc:desc="RAM Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="RAM_SD" edc:nzwidth="0x1" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050434"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_HROMC" edc:nzwidth="0x20" edc:access="----------------------nn---nnnnn" edc:impl="0x31F" edc:_addr="0x40050440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x1" edc:desc="HROMC Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x1" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050444"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_HCACHEI_VALID" edc:nzwidth="0x20" edc:access="---------------------nnn---nnnnn" edc:impl="0x71F" edc:_addr="0x40050450">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x1" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x1" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x1" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_HCACHEI_DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40050454">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM" edc:nzwidth="0x10" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME" edc:nzwidth="0x4" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x4" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x4" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x4" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_HCACHEI_TAG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40050458">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM" edc:nzwidth="0x10" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME" edc:nzwidth="0x4" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x4" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x4" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x4" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4005045C"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_HCACHED_VALID" edc:nzwidth="0x20" edc:access="---------------------nnn---nnnnn" edc:impl="0x71F" edc:_addr="0x40050460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM" edc:nzwidth="0x4" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME" edc:nzwidth="0x1" edc:desc="Read Margin Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x1" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x1" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x1" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_HCACHED_DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40050464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="RM" edc:nzwidth="0x10" edc:desc="Read Margin"/>
            <edc:SFRFieldDef edc:cname="RME" edc:nzwidth="0x4" edc:desc="Read Margin Enable"/>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x4" edc:desc="Light Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x4" edc:desc="Deep Sleep Mode"/>
            <edc:SFRFieldDef edc:cname="SD" edc:nzwidth="0x4" edc:desc="Shutdown Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
