Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB02RTC_FSTR" edc:nzwidth="0x20" edc:access="r---rrrr-rrrrrrr-rrrrrrr-rrrrrrr" edc:impl="0x8F7F7F7F" edc:_addr="0x40053160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Seconds of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minutes of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hours of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEVCNT" edc:nzwidth="0x4" edc:desc="Tamper Events Counter (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:nzwidth="0x1" edc:desc="System Mode of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB02RTC_FSDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40053164">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTC_TIME" edc:nzwidth="0x20" edc:desc="Time of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x7" edc:desc="Year of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Day of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB02RTC_LSTR" edc:nzwidth="0x20" edc:access="r--------rrrrrrr-rrrrrrr-rrrrrrr" edc:impl="0x807F7F7F" edc:_addr="0x40053168">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Seconds of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minutes of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hours of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:nzwidth="0x1" edc:desc="System Mode of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB02RTC_LSDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4005316C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTC_TIME" edc:nzwidth="0x20" edc:desc="Time of the Tamper (cleared on read)"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x7" edc:desc="Year of the Tamper (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month of the Tamper (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Day of the Tamper (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date of the Tamper (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB03RTC_FSTR" edc:nzwidth="0x20" edc:access="r---rrrr-rrrrrrr-rrrrrrr-rrrrrrr" edc:impl="0x8F7F7F7F" edc:_addr="0x40053170">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Seconds of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minutes of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hours of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEVCNT" edc:nzwidth="0x4" edc:desc="Tamper Events Counter (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:nzwidth="0x1" edc:desc="System Mode of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB03RTC_FSDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40053174">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTC_TIME" edc:nzwidth="0x20" edc:desc="Time of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x7" edc:desc="Year of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Day of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB03RTC_LSTR" edc:nzwidth="0x20" edc:access="r--------rrrrrrr-rrrrrrr-rrrrrrr" edc:impl="0x807F7F7F" edc:_addr="0x40053178">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Seconds of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minutes of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hours of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:nzwidth="0x1" edc:desc="System Mode of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB03RTC_LSDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4005317C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTC_TIME" edc:nzwidth="0x20" edc:desc="Time of the Tamper (cleared on read)"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x7" edc:desc="Year of the Tamper (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month of the Tamper (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Day of the Tamper (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date of the Tamper (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
