Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX2051MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_RLIM" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x40053238">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="RPTHMIN" edc:nzwidth="0xC" edc:desc="Minimum Repeat Threshold"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RPTHMAX" edc:nzwidth="0xC" edc:desc="Maximum Repeat Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_PLIM" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x4005323C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERMIN" edc:nzwidth="0xC" edc:desc="Minimum Period"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PERMAX" edc:nzwidth="0xC" edc:desc="Maximum Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x67ACDC0" edc:_addr="0x40053240"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCER" edc:nzwidth="0x20" edc:access="--------wwww--ww----wwww--------" edc:impl="0xF30F00" edc:_addr="0x46800000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CPCK" edc:nzwidth="0x1" edc:desc="Coprocessor (Second Processor) Clocks Enable"/>
            <edc:SFRFieldDef edc:cname="CPBMCK" edc:nzwidth="0x1" edc:desc="Coprocessor Bus Master Clocks Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CPKEY" edc:nzwidth="0x4" edc:desc="Coprocessor Clocks Enable Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written to 0xA to validate CPBMCK and CPCK." edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCDR" edc:nzwidth="0x20" edc:access="--------wwww--ww----wwww--------" edc:impl="0xF30F00" edc:_addr="0x46800004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CPCK" edc:nzwidth="0x1" edc:desc="Coprocessor (Second Processor) Clocks Disable"/>
            <edc:SFRFieldDef edc:cname="CPBMCK" edc:nzwidth="0x1" edc:desc="Coprocessor Bus Master Clocks Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CPKEY" edc:nzwidth="0x4" edc:desc="Coprocessor Clocks Enable Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written to 0xA to validate CPBMCK and CPCK." edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCSR" edc:nzwidth="0x20" edc:access="--------------rr----rrrr------rr" edc:impl="0x30F03" edc:_addr="0x46800008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CPU_CLK0S" edc:nzwidth="0x1" edc:desc="CPU_CLK Status for Core 0"/>
            <edc:SFRFieldDef edc:cname="CPU_CLK1S" edc:nzwidth="0x1" edc:desc="CPU_CLK Status for Core 1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Status"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CPCK" edc:nzwidth="0x1" edc:desc="Coprocessor (Second Processor) Clocks Status"/>
            <edc:SFRFieldDef edc:cname="CPBMCK" edc:nzwidth="0x1" edc:desc="Coprocessor Bus Master Clocks Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_CTRL0" edc:nzwidth="0x20" edc:access="nnnnn-------nnnnnnnn----nnnnnnnn" edc:impl="0xF80FF0FF" edc:_addr="0x4680000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="DIVPMC0" edc:nzwidth="0x8" edc:desc="Divider for PMC output 0"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIVPMC1" edc:nzwidth="0x8" edc:desc="Divider for PMC output 1 (PLLA only)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PLLMS" edc:nzwidth="0x1" edc:desc="PLL Multiplexer Select"/>
            <edc:SFRFieldDef edc:cname="ENPLL" edc:nzwidth="0x1" edc:desc="Enable PLL"/>
            <edc:SFRFieldDef edc:cname="ENPLLO0" edc:nzwidth="0x1" edc:desc="Enable PLL Clock Output 0"/>
            <edc:SFRFieldDef edc:cname="ENPLLO1" edc:nzwidth="0x1" edc:desc="Enable PLL Clock Output 1 (PLLA only)"/>
            <edc:SFRFieldDef edc:cname="ENLOCK" edc:nzwidth="0x1" edc:desc="Enable PLL Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
